[{"body":"App: 0.4.5\nAndroid 10\n\nI have set the homepage type to blank or custom page that refer to duckduckgo.com and restart app still wont change. It's still use default about:homepage.","number":27,"title":"cannot change homepage type"},{"body":"App: 0.4.5\nAndroid 10\n\n1. When i set the toolbar position to the bottom with no contextual button then at about:homepage press ⁝ (three point dot); the menu wont appear but if the toolbar set to top then it should fine appeared.\n\n2. The toolbar and its contextual buttons cover part of the website. I've suggestion to create auto hide-unhide toolbar and contextual button option, fullscreen mode toggle feature located on the contextual button or menu — with maintain fullscreen toggle button to disable fullscreen mode (its button should auto-hide unhide), make a site viewport margins based on the dimensions of the toolbar and contextual buttons.\n\n3. Hide URL bar option cannot disable. After disable and test it; it still hiding, after disable then back to main setting > open the Customization settings; the option still active.\n","number":26,"title":"Toolbar issue"},{"body":"Happens quite often but at browser startup, it's fine. \nhttps://github.com/user-attachments/assets/6b026ad6-cb6c-4b28-87ec-8d1551397f88\n\nUsed the back navigation button on the bottom toolbar at last","number":25,"title":"Back gesture broken"},{"body":"The bar isn't an element on the webpage.\n![Screenshot_20251224-032229.png](https://github.com/user-attachments/assets/2ebcec0b-b1f2-482d-ac11-24b19c4e406d)\n\n","number":24,"title":"Black bar between keyboard and page while keyboard is active on form input"},{"body":"When you swipe to switch tabs the app, does switch the tab when it is not loaded after an app restart.\n\n[Screen Recording](https://files.catbox.moe/3ftgsf.mp4)","number":23,"title":"Swiping to switch tabs, sometimes does not work"},{"body":"When first exporting the settings of the app, it crashes when you are finished importing it and restarting the app.\n\nhttps://github.com/user-attachments/assets/3e044d6f-fd92-41a2-864d-9331116374c1\n\n**Device**\n- Os: FuntouchOS\n- Phone: Vivo Y36\n- Version: 15","number":22,"title":"Importing your settings crashes the app"},{"body":"Hello. \nIn full-screen mode, the top and bottom parts of the navigation window are inaccessible because the Android bottom bar and the Android top bar appear on top or in the foreground.","number":16,"title":"Display issue with Android 15."},{"body":"After closing all tabs, the homepage is not displayed and the page freezes.\n\nhttps://github.com/user-attachments/assets/dc213fc8-b0b5-4198-b7ca-e81e37a8e40f","number":12,"title":"Bug : The homepage is not displayed after closing a tab."}]
